# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\alvin\Desktop\ece445\deliverable\robot_kit_firmware.cydsn\robot_kit_firmware.cyprj
# Date: Sun, 11 Dec 2016 22:29:22 GMT
#set_units -time ns
create_clock -name {IR_ADC_intClock(FFB)} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {Clock_2(FFB)} -period 1104.1666666666665 -waveform {0 552.083333333333} [list [get_pins {ClockBlock/ff_div_7}] [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {Clock_1(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFCLK} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {IR_ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 17} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 1104.1666666666665 [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list [get_pins {ClockBlock/udb_div_3}]]


# Component constraints for C:\Users\alvin\Desktop\ece445\deliverable\robot_kit_firmware.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\alvin\Desktop\ece445\deliverable\robot_kit_firmware.cydsn\robot_kit_firmware.cyprj
# Date: Sun, 11 Dec 2016 22:29:19 GMT
